In [3]:
import pandas as pd
df = pd.DataFrame({
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'New York'],
    'cost': [100, 80, 90, 70, 60, 50]
})
df

          city  cost
0     New York   100
1  Los Angeles    80
2      Chicago    90
3      Houston    70
4      Phoenix    60
5     New York    50

### On the basis of Mean

In [6]:
mean_price = df.groupby('city')['cost'].mean().to_dict()
mean_price

{'Chicago': 90.0,
 'Houston': 70.0,
 'Los Angeles': 80.0,
 'New York': 75.0,
 'Phoenix': 60.0}

In [7]:
df['city_encoded'] = df['city'].map(mean_price)
df

          city  cost  city_encoded
0     New York   100          75.0
1  Los Angeles    80          80.0
2      Chicago    90          90.0
3      Houston    70          70.0
4      Phoenix    60          60.0
5     New York    50          75.0

In [8]:
df[['cost', 'city_encoded']]

   cost  city_encoded
0   100          75.0
1    80          80.0
2    90          90.0
3    70          70.0
4    60          60.0
5    50          75.0